from config import OWNER_USERNAME, SUPPORT_GRP
from UTTAM import UTTAM
from pyrogram import Client, filters


START = """**✦ » ʜᴇʟʟᴏ ʙᴀʙʏ 🥀**\n\n**✦ » 𝐈 ᴀᴍ ᴀᴜᴛᴏ ʀᴇᴀᴄᴛɪᴏɴ ʙᴏᴛ ғᴏʀ ᴄʜᴀɴɴᴇʟ, ᴘʀɪᴠᴀᴛᴇ ᴀɴᴅ ɢʀᴏᴜᴘ.**\n\n**✦ » 𝖶ɪᴛʜ /clone ᴀɴᴅ ʙʀᴏᴀᴅᴄᴀsᴛ ғᴇᴀᴛᴜʀᴇs.**\n\n**✦ » 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [⎯᪵፝֟፝֟⎯꯭𓆩꯭ 𝐀 ꯭ʟ ꯭ᴘ ꯭ʜ꯭ ᴧ꯭⎯꯭꯭‌꯭🥂꯭༎꯭ 𓆪](t.me/ll_ALPHA_BABY_lll)**"""

HELP_READ = f"""**
Cʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ʙᴇʟᴏᴡ ғᴏʀ ᴍᴏʀᴇ ɪɴғᴏʀᴍᴀᴛɪᴏɴ.  Iғ ʏᴏᴜ'ʀᴇ ғᴀᴄɪɴɢ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ʏᴏᴜ ᴄᴀɴ ᴀsᴋ ɪɴ [sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ](https://t.me/PURVI_SUPPORT).

Aʟʟ ᴄᴏᴍᴍᴀɴᴅs ᴄᴀɴ ʙᴇ ᴜsᴇᴅ ᴡɪᴛʜ: /**
"""

TOOLS_DATA_READ = f"""**
❖ 𝖢ᴏᴍᴍᴀɴᴅs ғᴏʀ ʀᴇᴀᴄᴛɪᴏɴ ʙᴏᴛ:

➻ /start sᴛᴀʀᴛ ᴛʜᴇ ʙᴏᴛ !
──────────────
➻ /ping ᴛᴏ ᴄʜᴇᴄᴋ ᴛʜᴇ ʀᴇsᴘᴏɴsᴇ ᴛɪᴍᴇ (ᴘɪɴɢ) ᴏғ ᴛʜᴇ ʙᴏᴛ!
──────────────
➻ /id ᴛᴏ ɢᴇᴛ ʏᴏᴜʀ ᴜsᴇʀ ɪᴅ, ᴄʜᴀᴛ ɪᴅ, ᴀɴᴅ ᴍᴇssᴀɢᴇ ɪᴅ ᴀʟʟ ɪɴ ᴏɴᴇ ᴍᴇssᴀɢᴇ.
──────────────
➻ /stats - ɢᴇᴛ ʙᴏᴛ ꜱᴛᴀᴛꜱ
──────────────
➻ /broadcast ᴛᴏ ғᴏʀᴡᴀʀᴅ ᴀ ᴍᴇssᴀɢᴇ ᴛᴏ ᴀʟʟ ᴄʜᴀᴛs ʙᴀsᴇᴅ ᴏɴ sᴘᴇᴄɪғɪᴇᴅ ғʟᴀɢs!\nᴇxᴀᴍᴘʟᴇ: `/broadcast -user -pin ʜᴇʟʟᴏ ғʀɪᴇɴᴅs`
──────────────
✦ » 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [𝖯ᴜʀᴠɪ 𝖡ᴏᴛs](t.me/PURVI_SUPPORT)**
"""

CHATBOT_READ = f"""**
❖ 𝖢ᴏᴍᴍᴀɴᴅs ғᴏʀ ᴄʟᴏɴᴇ ғᴇᴀᴛᴜʀᴇs :

➻ /clone [ ʙᴏᴛ ᴛᴏᴋᴇɴ ] - ᴍᴀᴋᴇ ʏᴏᴜʀ ᴏᴡɴ ʙᴏᴛ.
──────────────
➻ /cloned - sᴇᴇ ᴄʟᴏɴᴇᴅ ʙᴏᴛs.
──────────────
➻ /delclone - ʀᴇᴍᴏᴠᴇ ʏᴏᴜʀ ʙᴏᴛ ᴄʟᴏɴᴇ.
──────────────
➻ /delallclone - ʀᴇᴍᴏᴠᴇ ᴀʟʟ ᴄʟᴏɴᴇᴅ ʙᴏᴛs ᴏɴʟʏ ᴏᴡɴᴇʀ ᴜsᴇ ᴛʜɪs ᴄᴏᴍᴍᴀɴᴅ.
──────────────
✦ » 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [𝖯ᴜʀᴠɪ 𝖡ᴏᴛs](t.me/PURVI_SUPPORT)**
"""

SOURCE_READ = f"**ʜᴇʏ, ᴛʜᴇ sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ ᴏғ [{UTTAM.name}](https://t.me/{UTTAM.username}) ɪs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ.**\n**ᴘʟᴇᴀsᴇ ғᴏʀᴋ ᴛʜᴇ ʀᴇᴘᴏ & ɢɪᴠᴇ ᴛʜᴇ sᴛᴀʀ ✯**\n**──────────────────**\n**ʜᴇʀᴇ ɪs ᴛʜᴇ [sᴏᴜʀᴄᴇ ᴄᴏᴅᴇ](https://github.com/THE-VIP-BOY-OP/VIP-CHATBOT)**\n**──────────────────**\n**ɪғ ʏᴏᴜ ғᴀᴄᴇ ᴀɴʏ ᴘʀᴏʙʟᴇᴍ ᴛʜᴇɴ ᴄᴏɴᴛᴀᴄᴛ ᴀᴛ [sᴜᴘᴘᴏʀᴛ ᴄʜᴀᴛ](https://t.me/{SUPPORT_GRP}).\n<b>✦ » 𝐏ᴏᴡᴇʀᴇᴅ 𝖡ʏ » [𝖯ᴜʀᴠɪ 𝖡ᴏᴛs](t.me/PURVI_SUPPORT)</b>"

ADMIN_READ = f"sᴏᴏɴ"

ABOUT_READ = f"""
**➻ [{UTTAM.name}](https://t.me/{UTTAM.username}) ʀᴇᴀᴄᴛ ᴀᴜᴛᴏᴍᴀᴛɪᴄᴀʟʟʏ ᴛᴏ ᴀ ᴍᴇssᴇᴀɢᴇ.**
**➻ ʜᴇʟᴘs ʏᴏᴜ ɪɴ ᴍᴀᴋᴇ ʀᴇᴀᴄᴛɪᴏɴ sᴛᴀᴛs ɢʀᴏᴜᴘs / ᴄʜᴀɴɴᴇʟ.**
**➻ ᴡʀɪᴛᴛᴇɴ ɪɴ [ᴘʏᴛʜᴏɴ](https://www.python.org) ᴡɪᴛʜ [ᴍᴏɴɢᴏ-ᴅʙ](https://www.mongodb.com) ᴀs ᴀ ᴅᴀᴛᴀʙᴀsᴇ**
**──────────────**
**➻ ᴄʟɪᴄᴋ ᴏɴ ᴛʜᴇ ʙᴜᴛᴛᴏɴs ɢɪᴠᴇɴ ʙᴇʟᴏᴡ ғᴏʀ ɢᴇᴛᴛɪɴɢ ʙᴀsɪᴄ ʜᴇʟᴩ ᴀɴᴅ ɪɴғᴏ ᴀʙᴏᴜᴛ [{UTTAM.name}](https://t.me/{UTTAM.username})**
"""
